#+TITLE: Agenda
#+AUTHOR: semenInRussia
#+OPTIONS: *:t ':t
#+TODO: TODO | DONE
#+TODO: MUST-SEE | SAW
#+TODO: FAIL | GOAL DONE

* Planes

** Targets on Week

*** TODO Run the main file of the project in =run-command-reicpes= :run_command_recipes:

*** TODO =racket-mmanager=

*** TODO Complete ICT of the =MIPT=
DEADLINE: <2022-10-06 -20d Чт>

*** TODO explore the =xetex=                                          :latex:

*** TODO add support of the =org-export= to the =run-command-recipes= :run_command_recipes:

*** TODO Xenops in non \documentclass =LaTeX= documents
SCHEDULED: <2022-09-24 Сб>

*** TODO New =embrace= with support of the =smartparens=
SCHEDULED: <2022-09-24 Сб>

*** TODO Impatient modes for all =major-modes=
SCHEDULED: <2022-09-24 Сб>

*** TODO Fix =my-copy-buffer-content-as-mipt-solution=
SCHEDULED: <2022-09-24 Сб>

*** TODO More useful way to run =run-command-recipes= recipes
SCHEDULED: <2022-10-26 Ср>



See on the compile command from the =latex-extra=

*** TODO Keys for the centering =org-mode= table columns
SCHEDULED: <2022-09-24 Сб>

*** TODO Live evaluating of the =org-mode= table formulas
SCHEDULED: <2022-09-24 Сб>

*** DONE From the =use-package= to the =leaf=
SCHEDULED: <2022-09-24 Сб>

*** DONE From the =org-mode= configuration to the pure =elisp= config
SCHEDULED: <2022-09-24 Сб>

Should be byte-compile clearly

*** DONE Fix the /f/ key binding for the =org-speed-keys=
SCHEDULED: <2022-09-24 Сб>

*** TODO Fix =sp-kill-whole-line=
SCHEDULED: <2022-09-24 Сб>

*** TODO Post commit hook for Emacs.org (delete DONE =org-mode= heading)

*** DONE Key bind for =org-kill-special=

*** TODO Make wrapper for birthday congurlation

*** TODO Insert ;nofmt in elisp keybinding
*** TODO Byte compile all config after kill =Emacs=
*** DONE After /s/ revert buffer and change the position in the =dired=
*** DONE Embrace for =emacs-lisp-mode=
*** DONE Save Time of the loading config modules
*** DONE My leaf keywords : simple as may
*** TODO System for the reformat for certain =major-modes= at overwrited /SPC SPC q/ keybinding
*** TODO New refactor library for the =emacs-lisp=
- add/change group/type for defcustom
- extract code to defun or lambda argument/let binding/defun/defvar/defcustom and etc.
- lambda => defun, defun => lambda
- add/delete interactive binding for defun/lib (depends on args)
- add/delete docstring for defun
- add/delete autoload
- defcustom=>defvar, defvar=>defcustom
*** TODO Explore =lsp-mode=
*** DONE Automatically sorting =org-mode= options
*** TODO Autload after /:fast-exec/ keyword in =leaf=
*** TODO Explore =ov=
*** TODO Explore =coq=
*** TODO New =fast-exec=
*** TODO Fix =my-projectile=
*** TODO Fix =M-ret= in =Emacs-lisp=
*** TODO Fix tests
*** TODO Auto reloading of the =fast-exec=
**** TODO More cool readme (provided by =leaf= statisitcs)
*** TODO Finish commit editing =magit= on /SPC ;/
** Targets on Day





*** TODO Use =latex-extra-run-all= in the =org-export=
SCHEDULED: <2022-09-24 Сб>

*** DONE Command for the =org-mode= options setting
SCHEDULED: <2022-09-24 Сб>

*** DONE Fix =xah-fly-keys= in =calc=
SCHEDULED: <2022-09-23 Пт>


* Films 

** MUST-SEE Thor: Love and Thunder
   :PROPERTIES:
   :name:     Тор: Любовь и гром
   :year:     2022
   :slogan:   Not every god has a plan.
   :id:       1282688
   :rating:   65.0
   :countries: (Австралия США)
   :END:

** MUST-SEE The Batman
   :PROPERTIES:
   :name:     Бэтмен
   :year:     2022
   :slogan:   Unmask The Truth
   :id:       590286
   :rating:   79.0
   :countries: (США)
   :END:

** MUST-SEE Missionary: Impossible
   :PROPERTIES:
   :name:     Миссия невыполнима
   :year:     2006
   :slogan:   nil
   :id:       305389
   :rating:   0
   :countries: (США)
   :END:

** MUST-SEE Doctor Strange in the Multiverse of Madness
   :PROPERTIES:
   :name:     Доктор Стрэндж: В мультивселенной безумия
   :year:     2022
   :slogan:   Enter a new dimension of Strange.
   :id:       1219909
   :rating:   67.0
   :countries: (США)
   :END:

** MUST-SEE Raiders of the Lost Ark
:PROPERTIES:
:name:     Индиана Джонс: В поисках утраченного ковчега
:year:     1981
:slogan:   Indiana Jones - the new hero from the creators of JAWS and STAR WARS
:id:       339
:rating:   80.0
:countries: (США)
:END:



|           a | name | index |  an | 0     |
|-------------+------+-------+-----+-------|
| 4.5 + x / 4 |    2 |     4 |   6 | 6 + x |
|         4.5 |    9 |     0 |   8 | 6 + x |
|       205.5 |   90 |   300 | 431 | 6 + x |
#+TBLFM: $1=vmean($2..$5)::$5=6+x

** MUST-SEE The Matrix Resurrections
:PROPERTIES:
:name:     Матрица: Воскрешение
:year:     2021
:slogan:   Выбор за тобой
:id:       1294123
:rating:   58.0
:countries: (Австралия США)
:END:

** MUST-SEE Gladiator
:PROPERTIES:
:name:     Гладиатор
:year:     2000
:slogan:   Генерал, ставший рабом. Раб, ставший гладиатором. Гладиатор, бросивший вызов империи
:id:       474
:rating:   86.0
:countries: (Великобритания Мальта Марокко США)
:END:

 

